tutorials/solution-time/SIPM-IP/singleCavity/momPred/caseB/constant/couplingProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      couplingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatch left;

fluidPatch right;


//movingRegion region0;



patchTolerance 1e-6;

energyTolerance 1e-6;

energyLoop	false;

maxOuterCorr	150;




// ************************************************************************* //
